app/controllers/coctails_controller.rb

  def index
    if params[:ingredient_id]
      ing = Ingredient.find(params[:ingredient_id])
      @ingredients = [ing]
      @coctails = ing.coctails
      render :list_by_ingredients
    else
      @coctails = Coctail.all
---
SELECT * FROM "ingredients" WHERE ("ingredients"."id" = 1)
SELECT * FROM "coctails" INNER JOIN "coctails_ingredients" ON "coctails".id = "coctails_ingredients".coctail_id WHERE ("coctails_ingredients".ingredient_id = 1 )

  def show
    @coctail = Coctail.find(params[:id])
---
SELECT * FROM "coctails" WHERE ("coctails"."id" = 1)

  def search
    @coctails = Coctail.search(params[:query])
---
SELECT * FROM "coctails" WHERE (name like '%mo%')

  def search_by_ingredients
    @coctails = Coctail.search(params[:query])
---
SELECT * FROM "coctails" WHERE (name LIKE '%a%')

  def create
    @coctail = Coctail.new(params[:coctail])

    respond_to do |format|
      if @coctail.save
---
INSERT INTO "coctails" ("name", "created_at", "updated_at") VALUES('White Russian', '2010-05-10 17:49:13', '2010-05-10 17:49:13')