app/controllers/ingredients_controller.rb

  def index
    @ingredients = Ingredient.all
---
SELECT * FROM "ingredients"

  def show
    @ingredient = Ingredient.find(params[:id])
---
SELECT * FROM "ingredients" WHERE ("ingredients"."id" = 1)

  def edit
    @ingredient = Ingredient.find(params[:id])
---
SELECT * FROM "ingredients" WHERE ("ingredients"."id" = 8)

  def create
    @ingredient = Ingredient.new(params[:ingredient])

    respond_to do |format|
      if @ingredient.save
---
INSERT INTO "ingredients" ("name", "created_at", "updated_at") VALUES('wódka', '2010-05-10 17:46:33', '2010-05-10 17:46:33')

  def destroy
    @ingredient = Ingredient.find(params[:id])
    @ingredient.destroy
---
SELECT * FROM "ingredients" WHERE ("ingredients"."id" = 10)
DELETE FROM "ingredients" WHERE "id" = 10